ataradov/mcu-starter-projects/samg53/include/component/supc.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SUPC_MR_OFFSET                      (0x08)                                        /**<  (SUPC_MR) Supply Controller Mode Register  Offset */

#define SUPC_MR_BODRSTEN_Pos                12                                             /**< (SUPC_MR) POR Core Reset Enable Position */
#define SUPC_MR_BODRSTEN_Msk                (_U_(0x1) << SUPC_MR_BODRSTEN_Pos)             /**< (SUPC_MR) POR Core Reset Enable Mask */
#define SUPC_MR_BODRSTEN                    SUPC_MR_BODRSTEN_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use SUPC_MR_BODRSTEN_Msk instead */
#define   SUPC_MR_BODRSTEN_NOT_ENABLE_Val   _U_(0x0)                                       /**< (SUPC_MR) The core reset signal vddcore_nreset is not affected when a brownout detection occurs.  */
#define   SUPC_MR_BODRSTEN_ENABLE_Val       _U_(0x1)                                       /**< (SUPC_MR) The core reset signal vddcore_nreset is asserted when a brownout detection occurs.  */
#define SUPC_MR_BODRSTEN_NOT_ENABLE         (SUPC_MR_BODRSTEN_NOT_ENABLE_Val << SUPC_MR_BODRSTEN_Pos)  /**< (SUPC_MR) The core reset signal vddcore_nreset is not affected when a brownout detection occurs. Position  */
#define SUPC_MR_BODRSTEN_ENABLE             (SUPC_MR_BODRSTEN_ENABLE_Val << SUPC_MR_BODRSTEN_Pos)  /**< (SUPC_MR) The core reset signal vddcore_nreset is asserted when a brownout detection occurs. Position  */
#define SUPC_MR_BODDIS_Pos                  13                                             /**< (SUPC_MR) POR Core Disable Position */
#define SUPC_MR_BODDIS_Msk                  (_U_(0x1) << SUPC_MR_BODDIS_Pos)               /**< (SUPC_MR) POR Core Disable Mask */
#define SUPC_MR_BODDIS                      SUPC_MR_BODDIS_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use SUPC_MR_BODDIS_Msk instead */
#define   SUPC_MR_BODDIS_ENABLE_Val         _U_(0x0)                                       /**< (SUPC_MR) The core brownout detector is enabled.  */
#define   SUPC_MR_BODDIS_DISABLE_Val        _U_(0x1)                                       /**< (SUPC_MR) The core brownout detector is disabled.  */
#define SUPC_MR_BODDIS_ENABLE               (SUPC_MR_BODDIS_ENABLE_Val << SUPC_MR_BODDIS_Pos)  /**< (SUPC_MR) The core brownout detector is enabled. Position  */
#define SUPC_MR_BODDIS_DISABLE              (SUPC_MR_BODDIS_DISABLE_Val << SUPC_MR_BODDIS_Pos)  /**< (SUPC_MR) The core brownout detector is disabled. Position  */
#define SUPC_MR_OSCBYPASS_Pos               20                                             /**< (SUPC_MR) Oscillator Bypass Position */
#define SUPC_MR_OSCBYPASS_Msk               (_U_(0x1) << SUPC_MR_OSCBYPASS_Pos)            /**< (SUPC_MR) Oscillator Bypass Mask */
#define SUPC_MR_OSCBYPASS                   SUPC_MR_OSCBYPASS_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use SUPC_MR_OSCBYPASS_Msk instead */
#define   SUPC_MR_OSCBYPASS_NO_EFFECT_Val   _U_(0x0)                                       /**< (SUPC_MR) No effect. Clock selection depends on XTALSEL value.  */
#define   SUPC_MR_OSCBYPASS_BYPASS_Val      _U_(0x1)                                       /**< (SUPC_MR) The 32 kHz crystal oscillator is bypassed if XTALSEL=1. OSCBYPASS must be set prior to write XTALSEL=1.  */
#define SUPC_MR_OSCBYPASS_NO_EFFECT         (SUPC_MR_OSCBYPASS_NO_EFFECT_Val << SUPC_MR_OSCBYPASS_Pos)  /**< (SUPC_MR) No effect. Clock selection depends on XTALSEL value. Position  */
#define SUPC_MR_OSCBYPASS_BYPASS            (SUPC_MR_OSCBYPASS_BYPASS_Val << SUPC_MR_OSCBYPASS_Pos)  /**< (SUPC_MR) The 32 kHz crystal oscillator is bypassed if XTALSEL=1. OSCBYPASS must be set prior to write XTALSEL=1. Position  */
#define SUPC_MR_PSWITCH1_Pos                22                                             /**< (SUPC_MR) SRAM1 Power Switch Position */
#define SUPC_MR_PSWITCH1_Msk                (_U_(0x1) << SUPC_MR_PSWITCH1_Pos)             /**< (SUPC_MR) SRAM1 Power Switch Mask */
#define SUPC_MR_PSWITCH1                    SUPC_MR_PSWITCH1_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use SUPC_MR_PSWITCH1_Msk instead */
#define   SUPC_MR_PSWITCH1_OFF_Val          _U_(0x0)                                       /**< (SUPC_MR) The SRAM1 is not powered.  */
#define   SUPC_MR_PSWITCH1_ON_Val           _U_(0x1)                                       /**< (SUPC_MR) The SRAM1 is powered.  */
#define SUPC_MR_PSWITCH1_OFF                (SUPC_MR_PSWITCH1_OFF_Val << SUPC_MR_PSWITCH1_Pos)  /**< (SUPC_MR) The SRAM1 is not powered. Position  */
#define SUPC_MR_PSWITCH1_ON                 (SUPC_MR_PSWITCH1_ON_Val << SUPC_MR_PSWITCH1_Pos)  /**< (SUPC_MR) The SRAM1 is powered. Position  */
#define SUPC_MR_PSWITCH2_Pos                23                                             /**< (SUPC_MR) SRAM2 Power Switch Position */
#define SUPC_MR_PSWITCH2_Msk                (_U_(0x1) << SUPC_MR_PSWITCH2_Pos)             /**< (SUPC_MR) SRAM2 Power Switch Mask */
#define SUPC_MR_PSWITCH2                    SUPC_MR_PSWITCH2_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use SUPC_MR_PSWITCH2_Msk instead */
#define   SUPC_MR_PSWITCH2_OFF_Val          _U_(0x0)                                       /**< (SUPC_MR) The SRAM2 is not powered.  */
#define   SUPC_MR_PSWITCH2_ON_Val           _U_(0x1)                                       /**< (SUPC_MR) The SRAM2 is powered.  */
#define SUPC_MR_PSWITCH2_OFF                (SUPC_MR_PSWITCH2_OFF_Val << SUPC_MR_PSWITCH2_Pos)  /**< (SUPC_MR) The SRAM2 is not powered. Position  */
#define SUPC_MR_PSWITCH2_ON                 (SUPC_MR_PSWITCH2_ON_Val << SUPC_MR_PSWITCH2_Pos)  /**< (SUPC_MR) The SRAM2 is powered. Position  */
#define SUPC_MR_KEY_Pos                     24                                             /**< (SUPC_MR) Password Key Position */
#define SUPC_MR_KEY_Msk                     (_U_(0xFF) << SUPC_MR_KEY_Pos)                 /**< (SUPC_MR) Password Key Mask */
#define SUPC_MR_KEY(value)                  (SUPC_MR_KEY_Msk & ((value) << SUPC_MR_KEY_Pos))
#define   SUPC_MR_KEY_PASSWD_Val            _U_(0xA5)                                      /**< (SUPC_MR) Writing any other value in this field aborts the write operation.Always reads as 0.  */
#define SUPC_MR_KEY_PASSWD                  (SUPC_MR_KEY_PASSWD_Val << SUPC_MR_KEY_Pos)    /**< (SUPC_MR) Writing any other value in this field aborts the write operation.Always reads as 0. Position  */
#define SUPC_MR_MASK                        _U_(0xFFD03000)                                /**< \deprecated (SUPC_MR) Register MASK  (Use SUPC_MR_Msk instead)  */
#define SUPC_MR_Msk                         _U_(0xFFD03000)                                /**< (SUPC_MR) Register Mask  */

